Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Properties applied to objects constructed at compile-time, such as variables and classes, are also called traits.
ja: 変数やクラスのように、コンパイル時に構成されるオブジェクトに適用されるプロパティはトレイトとも呼ばれます。

source: Properties are like object attributes, except that they're managed by the individual object rather than by the object's class.
ja: プロパティはオブジェクト属性のようですが、それらはクラスよりもむしろ個々のオブジェクトによって管理されます。

source: Properties on Objects
ja: オブジェクトのプロパティ

source: Protos
ja: プロト

source: Put simply, methods in the class always supersede methods which a role may provide.
ja: 簡単に説明すると、クラスのメソッドはロールが提供するであろうメソッドを常に破棄します。

source: Querying the methods of the KarmaKeeper class through introspection will report that the class has both a process method and an on-message multi method.
ja: イントロスペクションを通してKarmaKeeperクラスのメソッドを問い合わせると、クラスがprocessメソッドとon-messageマルチメソッドを両方持っていると報告するでしょう。

source: Rather than listing each character in the character class individually, you may specify a range of characters by placing the range operator .. between the beginning and ending characters:
ja: 個々に別々の文字を文字クラスにリストするよりも、始めと終わりの文字の間にレンジ演算子..を置くことによって文字のレンジを指定します：

source: Read this code as "For each element of sorted, set $n to the element, then execute the contents of the following block." say prints its arguments to the standard output (the screen, normally), followed by a newline.
ja: このコードはこのように読んでください。「ソートされた要素ごとに要素を$nにセットし、以下のブロックの内容を実行しなさい。」sayはその引数を標準出力（通常はスクリーン）に出力します。そして、改行文字が続きます。

source: Regardless of how many times the first capture matches (and how many elements are in $/[0]), the second capture is still available in $/[1].
ja: 最初のキャプチャーが何回マッチしたかに関係なく（そしていくつの要素が$/[0]に入っているかに関係なく）、2番目のキャプチャーはまだ$/[1]で利用できます。

source: Regardless of the take's immediate context, the object returned is also added to the list of values being gathered, which is returned by the gather as a lazy list (that is, an iterator, really), with each argument element of that list corresponding to one take.
ja: takeの直接のコンテキストに関わらず、返されたオブジェクトも集められた値のリストに追加され、それはgatherによってレイジーリストとして返される（すなわち、本当にイテレータ）そのリストの一つのtakeに対応するそれぞれの引数の要素と一緒に。

source: Regex can be very useful for extracting information too.
ja: 正規表現は情報を抜き出すためにも役に立ちます。

source: Regex names may be constructed the same as subroutine names or method names.
ja: 正規表現名はサブルーチン名またはメソッド名をつけるのと同じように構成されます。

source: Regex support special (also called metasyntactic) characters.
ja: 正規表現は、特別な（メタ構文とも呼ばれる）文字をサポートします。

source: Regexes are also good for data manipulation.
ja: 正規表現はデータ操作にもよいです。

source: Regexes can be recursive.
ja: 正規表現は再帰的でありえます。

source: Regular expressions are a computer science concept where simple patterns describe the format of text.
ja: 正規表現は、単純なパターンがテキストのフォーマットを記述するコンピューターサイエンス概念です。

source: Relationship between Perl 6 and Perl 5
ja: Perl 6とPerl 5の関係

source: Relying on the side effects of type checks produces unreliable code.
ja: 型チェックの副作用に頼ることは信頼できないコードを生み出します。

source: Remember, no implicit block scopes.) It is also possible to write
ja: 暗黙のブロックスコープはないことを覚えておくこと。）それは次のようにも書ける。

source: Remove the next paragraph when appropriate.
ja: 適切なら次の文節は削除してださい。

source: Renaming Parameters
ja: パラメータの名前を変える

source: Replacing the ! with a . both declares the attribute $!done and an accessor method named done.
ja: !を.に置き換えると属性$!doneとアクセサメソッドdoneを両方宣言します。

source: Required Parameters
ja: 必須パラメータ

source: Required parameters must always appear at the beginning of a subroutine's parameter list.
ja: 必須のパラメータは常にサブルーチンのパラメータリストの始めに現れなければなりません。

source: Required positional parameters need to come before optional positional parameters.
ja: 必須の順序依存パラメータは任意の位置依存パラメータの前にくる必要があります。

source: Resumable exceptions may also be implemented by simply marking the current exception as "resumed", in which case the original exception thrower simply returns to the code that threw the resumable exception, rather than unwinding before returning.
ja: 再開可能な例外は現在の例外を単純に「resumed」としてマーキングして実装される。その場合に初期の例外を投げるものは再開可能な例外を投げたコードを単純に返す。返す前に巻き戻すよりも。

source: Resumable exceptions may or may not leave normally depending on the implementation.
ja: 再開可能な例外が普通に去るかどうかは実装に依存する。

source: Return Types
ja: 返り値の型

source: Returning Results
ja: 結果を返す

source: Roles
ja: ロール

source: Roles get much more interesting in the case of a conflict.
ja: ロールは競合の場合にずっと興味深くなります。

source: Roles handle the task of code reuse.
ja: ロールは、コード再利用のタスクを取り扱います。

source: Roles in Perl 6 are first-class entities, just like classes.
ja: Perl 6のロールはまるでクラスのようなファーストクラス実体です。

source: Runtime Application of Roles
ja: ロールの実行時適用

source: Runtime application differs from compile time composition in that methods in the applied role will automatically override any of the same name within the class of the object.
ja: 適用されたロールのそのメソッドがオブジェクトのクラスの同じ名前のメソッドを自動的にオーバーライドするという点で、実行時の適用はコンパイル時の合成と異なります。

source: Runtime role application with does modifies an object in place: $x does SomeRole modifies the object stored in $x.
ja: doesによる実行時ロール適用は、その場でオブジェクトを変更します：$x does SomeRoleは、$xに保存されるオブジェクトを変更します。

source: Scissors win against paper, paper wraps rock, and scissors can't cut rock, but go blunt trying.
ja: ハサミは紙に対して勝ち、紙は岩を包み、そしてハサミは岩を切ることができなくてなまくらになります。

source: Scope declarators
ja: スコープ宣言

source: Searching for literal strings gets boring pretty quickly.
ja: リテラル文字列を捜すことは、かなり速くて退屈です。

source: Second, a method places its invocant into the special variable self.
ja: 第2に、メソッドはそのインボカントを特殊変数selfに入れます。

source: Second, it declares the variables in the subroutine to which the arguments are bound.
ja: 2つ目に、引数にバインドされたサブルーチン内の変数を宣言します。

source: See Control Exceptions below.
ja: 以下、Control Exceptionsを参照。

source: See link for more information.
ja: 詳細はリンクを見てください。

source: See S02 for a long definition of argument, but in short, it's either an ordinary object or a parcel containing multiple values.
ja: 引数の長い定義はS02を参照。 一言で言えば、普通のオブジェクトか多数の値を含むパーセルだ。

source: See IEEE standard 1003.1-2001), we continue to call them regex.
ja: 我々はそれらをregexと呼び続けています。

source: See S06 for more on function parameters.
ja: 関数のパラメータについてより詳しくはS06を参照。

source: See below.
ja: 以下を参照。

source: See previous section for discussion of ways to return from catch lambdas.
ja: キャッチlambdaから返す方法の議論は前のセクションを参照。

source: Separate alternations--parts of a regex of which any can match--with vertical bars.
ja: 選択肢の分離 ― 正規表現のどれかの部分は垂直バーでマッチできます。

source: Separate clones of the closure get separate state variables.
ja: 異なるクロージャのクローンは異なるstate変数を得る。

source: Several implementations exist at various levels of maturity.
ja: いくつかの実装が様々な成熟レベルに存在します。

source: Several other common control sequences each match a single character; you can find a list of those in link.
ja: いくつかの他の共通制御シーケンスは、一つの文字に各々マッチします；あなたは、それらのリストをリンクで見つけることができます。

source: Shorthand
ja: 短縮形

source: Should you accidentally run the file with Perl 5, you'll get a helpful error message.
ja: あなたが偶然にもPerl 5でファイルを実行するならば、役に立つエラーメッセージが得られるでしょう。

source: Show how to create a graph with cycles and explain why the perform method of a Task whose dependencies contain a cycle would never terminate successfully.
ja: 循環でグラフを作成する方法を示して、従属物がサイクルを含むTaskのperformメソッドがなぜ決して終わらないかについて説明してください。

source: Sigils
ja: シギル

source: Sigils are now invariant.
ja: シギルは現在は不変です。

source: Sigils indicate the default access method for a variable.
ja: シギルは変数のためのデフォルトアクセス方式を示します。

source: Sigils indicate the structural interface for the variable, such as whether it should be treated as a single value, a compound value, a subroutine, etc.
ja: それが一つの値、複合値、サブルーチンなどとみなされるべきであるかどうかにかかわらず、シギルは変数のために構造上のインターフェースを示します。

source: Signature introspection allows you to build interfaces that can obtain and then pass the right data to a subroutine.
ja: シグネチャーイントロスペクションは、あなたがサブルーチンの正常なデータを得ることができて、それから渡すことができるインターフェースを構築するのを可能にします。

source: Signatures are not just syntax; instead, they are first-class objects that hold a list of Parameter objects.
ja: シグネチャーはただの文法ではありません；代わりに、それはParameterオブジェクトのリストを保持するファーストクラスオブジェクトです。

source: Similarly, *%hash slurps all the remaining unbound named arguments into a hash.
ja: 同様に、*%hashは残り全てのバインドされていない名前付き引数をハッシュに入れます。

source: Similarly, portions of the match that are captured with parentheses are available as positional elements of the Match object (as if it were an array).
ja: 同様に、括弧でキャプチャーされるマッチ部分は位置依存要素のMatchオブジェクト（それが配列であるように）として使われます。

source: Similarly, the % sigil implies that the caller must pass an object that does the Associative role; that is, something which allows indexing through <...> or {...}.
ja: 同様に、%シギルは呼び出し元がAssociativeロールをするオブジェクトを渡さなければならないことを示します；つまり、<...>または{...}によるインデクシングが可能な何かです。

source: Since do is defined as going in front of a statement, it follows that it can always be followed by a statement label.
ja: doは文の前の出発として定義されるので、常に文ラベルが続くことができる。

source: Since when statements are presumed to be executed in order like normal statements, it's not required that all the statements in a switch block be when statements (though it helps the optimizer to have a sequence of contiguous when statements, because then it can arrange to jump directly to the first appropriate test that might possibly match.)
ja: when文は通常の文のように順番に実行されると仮定されるので、switchブロックのすべての文がwhen文になる必要はない（それは連続のwhenのシーケンスを持つためにオプティマイザを助ける。なぜならマッチできると思われる最初の適切なテストに直接ジャンプするようにアレンジできるからだ。）

source: Since a bare expression may be used as a statement, you may use do on an expression, but its only effect is to function as an unmatched left parenthesis, much like the $ operator in Haskell.
ja: 裸の式は文として使われると思われるので、doを式で使うだろう。しかしそれの唯一の効果は左括弧が対応がとれていない関数だ。Haskellの$演算子にとても似ている。

source: Since all exception handlers run in the dynamic scope of the throw, that reduces to simply returning from the warn function most of the time.
ja: 全ての例外ハンドラはスローのダイナミックスコープで実行するので、それは大抵の場合warn関数から単純に返すように変える。

source: Since any arbitrary Perl code can appear within curly braces, Arrays and Hashes may be interpolated by placing them within curly braces.
ja: どんな任意のPerlコードでもブレース内に表現できるので、ArrayとHashをブレース内に置くことによって展開することもできます。

source: Since bracketed expressions consider their insides to be statements, this works out consistently even where you might expect problems:
ja: 括弧に入れられた式はそれらの内部を文とみなすので、あなたが問題を予期している所でも一貫して上手くいく：

source: Since it is possible to pass arguments to parameters by name, the parameter names should be considered as part of a subroutine's public API.
ja: 引数を名前によってパラメータに渡すことが可能なので、パラメータ名はサブルーチンの公開APIの一部として考慮されるべきです。

source: Since leaving a block is considered a successful return, breaking out of one with succeed is also considered a successful return for the purposes of KEEP and UNDO.
ja: ブロックを去ることは成功したリターンとみなされるので、succeedで脱出することもKEEPとUNDOの目的のための成功したリターンとみなされる。

source: Since method calls are performed directly on any object, Nil can respond to certain method calls.
ja: メソッド呼び出しはどんなオブジェクトでも直接実行されるので、Nilはある程度のメソッド呼び出しに反応できます。

source: Since the final expression in a subroutine returns its value, it's possible to accidentally return a loop's return value when you were only evaluating the loop for its side effects.
ja: サブルーチンの最後の式はその値を返すので、あなたがループの副作用のために評価するだけという場合に、偶然にループの返り値を返すことが起こり得る。

source: Since the loop executes once before evaluating the condition, the bound parameter will be undefined that first time through the loop.
ja: 条件を評価する前にループを1回実行するので、結び付けられたパラメータはループの初回に未定義にされるだろう。

source: Since warnings are processed using the standard control exception mechanism, they may be intercepted and either suppressed or fatalized anywhere within the dynamic scope by supplying a suitable CONTROL block.
ja: 警告は標準の制御例外メカニズムを使って処理されるので、それらは横取りされることもでき、適切なCONTROLブロックの供給によるダイナミックスコープ内で抑制されるかどこでも致命的にされる。

source: Single quoted strings '...' do not interpolate:
ja: シングルクォート'...'の文字列は展開しません：

source: Single-line Comments
ja: ラインコメント

source: Slice context turns any parcel objects into Seq objects.
ja: スライスコンテキストはどんなパーセルオブジェクトでもSeqオブジェクトに変える。

source: Slurpy Parameters
ja: Slurpyなパラメータ

source: Slurpy arrays and hashes allow you to pass all positional and named arguments to another routine:
ja: slurpy配列とハッシュは全ての位置依存引数と名前付き引数を別のルーチンに渡すことを可能にします：

source: Smart Matching
ja: スマートマッチング

source: Smart match works by calling the ACCEPTS method on the operand on the right hand side and passing it the operand on the left hand side as an argument.
ja: スマートマッチは右側のオペランドでACCEPTSメソッドを呼び、左側のオペランドに引数として渡すことによって動作します。

source: So
ja: つまり

source: So /<[+.*]> / matches a plus sign, a dot or an asterisk.
ja: そのため、/<[+.*]> /はプラス記号、ドットまたはアスタリスクにマッチします。

source: So do the implicit conditionals implied by short-circuit operators.
ja: このように、暗黙の条件は短絡演算子によって暗に意味する。

source: So far every regex could match anywhere within a string.
ja: これまで、すべての正規表現は文字列の中でどこでもマッチすることができました。

source: So if you examine the ENTER trait of a block, you'll find that it's really a list of phasers rather than a single phaser.
ja: もしENTERブロックのトレイトを調査するなら、あなたは単独のphaserよりも本当のphaserのリストだと気づくだろう。

source: So logically, if the CATCH block throws its own exception, you would expect the CATCH block to catch its own exception recursively forever.
ja: 論理的には、もしCATCHブロックが独自の例外を投げるなら、あなたはCATCHブロックがその独自の例外を再帰的に絶えずキャッチすると期待するだろう。

source: So switching behavior is actually caused by the when statements in the block, not by the nature of the block itself.
ja: それゆえ、switchの振る舞いは実際はブロックのwhen文によって引き起こされ、ブロック自身の性質によってではない。

source: So the object in question is of class Employee or one that inherits from it, but not GeekCook.
ja: それで、問題のオブジェクトはクラスEmployeeまたはそれから継承したもので、GeekCookではありません。

source: So the old next LINE syntax is still allowed but really does something like LINE.next(()) underneath.
ja: それゆえ、next LINEという文法はまだ許可される。しかし本当は表面化にLINE.next(())のようなことをしている。

source: So they aren't really traits, exactly--they add themselves onto a list stored in the actual trait.
ja: それらは実際にはトレイトでないので、まさに―それらは実際のトレイトに格納されたリストに自身を加える。

source: So we will say that it is erroneous for a library writer to mix dynamic gather with callbacks unless those callbacks are somehow "ungathered" to the outer dynamic scope.
ja: そういうわけでダイナミックなgatherをコールバックと混ぜるのはライブラリ作者には誤りだと我々は言う。それらのコールバックが外側のダイナミックスコープにどういうわけか「ungathered」でない限り。

source: So, the call to JSON::Tiny::Grammar.parse($tester) attempts to match the regex named TOP to the string $tester.
ja: それで、JSON::Tiny::Grammar.parse($tester)の呼び出しは、文字列$testerにTOPという名の正規表現でマッチを試みます。

source: Some algorithms have very tidy and natural expressions with this feature, especially those which recurse to a simple base case.
ja: いくつかのアルゴリズムには、この特徴（特に単純なベースケースに再帰するそれら）で非常にきちんとして自然な式があります。

source: Some might ask, "Why call it Perl if it's a different language?" Perl is more than the vagaries of syntax.
ja: 何人かは尋ねるかもしれません。「異なる言語であるならば、なぜそれをPerlと呼ぶのですか？」Perlは構文の気まぐれ以上のものです。

source: Some object types can behave as value types.
ja: いくつかのオブジェクト型は値型として振る舞うことができます。

source: Some of the statement prefixes also behave a little bit like phasers, but they run in-line with the executable code, so they are spelled in lowercase.
ja: いくつかの文接頭辞も少しphasersのようにふるまう。しかしそれらは実行可能なコードとともにインラインを実行する。なのでそれらは小文字で綴る。

source: Some of these operators also fall back to a purely dynamic interpretation if the lexotic interpretation doesn't work.
ja: これらの演算子の幾つかは、レギゾチックな解釈が正常に動作しない場合に純粋な動的解釈に逆戻りすることもある。

source: Some of these phasers also have corresponding traits that can be set on variables.
ja: phasersのいくつかは変数にセットできる対応するトレイトも持つ。

source: Some parameters may have sensible default values, or may not be required for the sub-routine to operate; they merely add some extra, optional, configurability.
ja: いくつかのパラメータは適切なデフォルト値を持っているか、またはサブルーチンの動作に必要ないかもしれません；それらは任意の構成可能性をいくつか加えるだけです。

source: Some roles--parametric roles--allow the use of specific customizations to change how they provide the features they provide.
ja: いくつかのロール ― パラメトリックロール ― は、それらが提供する機構を変更するための特定のカスタマイズを可能にします。

source: Sometimes a type name is insufficient to describe the requirements for an argument.
ja: 時々、型名は引数の必要条件を記述するには不十分です。

source: Sometimes coercion is transparent.
ja: 時々、自動型変換は透過的です。

source: Sometimes it may be convenient to expose a parameter with one name while binding to a variable of a different name:
ja: 時々、変数を異なる名前にバインドしている時にパラメータを1つの名前で公開すると便利な場合があります：

source: Sometimes it's okay to have multiple methods of the same name, provided they have different signatures such that the multidispatch mechanism can distinguish between them.
ja: マルチディスパッチメカニズムがそれらを区別することができるように異なるシグネチャーがあるならば、時々、メソッドが同じ名前をつけるマルチプルを持ってもいいです。

source: Sometimes this modification is not what you want.
ja: 時々、この修正はあなたが望むものでありません。

source: Sometimes you just want to peek ahead to check if the next characters fulfill some properties without actually consuming them.
ja: 時々、あなたはちょうど次の文字がそれらを実際に消費することなくいくつかのプロパティを満たすかどうか調べるために前に覗きたいと思います。

source: Sometimes you may wish to make a Capture, store it and then later apply a subroutine--or multiple subroutines-- to the set of arguments it contains.
ja: 時々あなたはCaptureを作り、それを保存して後でサブルーチン ― または複数のサブルーチン ― にそれを含む引数を適用したいと思うかもしれません。

source: Sometimes you need to work with only part of an array or a hash.
ja: 時々、あなたは配列またはハッシュの1部分だけで作業する必要があります。

source: Sometimes you want to call other regexes, but don't want them to capture the matched text.
ja: 時々、他の正規表現を呼びたいが、それらがマッチテキストをキャプチャすることを望みません。

source: Sometimes you want to fill positional arguments from an array.
ja: たまに、配列をポジショナルな引数として使いたい時があります。

source: Sometimes, you may wish to allow a subroutine to receive any number of arguments, and collect them all together into an array.
ja: 時々、あなたはサブルーチンに多くの引数を受け取れるようにし、それらを全て配列に集めたいと思うでしょう。

source: Special variables
ja: 特殊変数

source: Specifying a dispatch candidate
ja: ディスパッチ候補を指定する

source: Square brackets around an infix operator cause Perl to apply the operator to a list element by element.
ja: 接中辞演算子のあたりの角括弧は、Perlが演算子をリストの要素と要素に適用するようにさせます。

source: Starting with class
ja: クラスで始める

source: String Comparisons
ja: 文字列の比較

source: Strings
ja: 文字列

source: Strings stored as Str are sequences of characters, independent of character encoding.
ja: Strとして格納される文字列は、エンコーディングから独立している文字のシーケンスです。

source: Strings, the Str Type
ja: 文字列、Str型

source: Subroutines and Signatures
ja: サブルーチンとシグネチャー

source: Subroutines and their signatures are objects like any other.
ja: サブルーチンとそれらのシグネチャーは何か他のオブジェクトのようです。

source: Subroutines can also return values.
ja: サブルーチンは値を返すこともできます。

source: Subscripts
ja: 添字付け

source: Subscripts are always evaluated in list context.
ja: 添字付けは常にリストコンテキストで評価されます。

source: Subsequent matches are straightforward and reflect the structure in which JSON components can appear.
ja: 以降のマッチは素直で、JSONコンポーネントが表れることができる構造を反映します。

source: Substitutions
ja: 置換

source: Such a situation is entirely possible, especially at larger tournaments.
ja: 特により大規模なトーナメントで、そのような状況は十分にあり得ます。

source: Such extensibility is difficult to achieve with ordinary, | delimited alternatives.
ja: そのような拡張性は、|で区切られた選択肢で普通に達成するのは困難です。

source: Suppose also you want to extend it to handle contractions such as doesn't or isn't:
ja: また、doesn'tやisn'tのような短縮形も扱いたいと考えています：

source: Suppose that you host a table tennis tournament.
ja: あなたが卓球トーナメントを主催すると仮定してください。

source: Suppose you found the example at the beginning of this chapter useful and want to make it available easily.
ja: 章の初めの例をもっと簡単に使えるようにしたいと思ったとします。

source: Suppose you want to enhance the JSON grammar to allow single-line C++ or JavaScript comments, which begin with // and continue until the end of the line.
ja: C++またはJavaScriptのシングルラインコメントをJSON文法で可能にしたいと仮定してください。それは//で始まり、行の終わりまで続きます。

source: Suppose you want to plot the number of sets that each player won in a tournament.
ja: あなたが各々のプレイヤーがトーナメントで獲得したセット数をプロットしたいと思ったとします。

source: Suppose you want to solve a crossword puzzle.
ja: あなたがクロスワードパズルを解きたいと思ったとします。

source: Surrounding part of a regex with round brackets (aka parentheses) (...) makes Perl capture the string it matches.
ja: 丸括弧で囲まれた正規表現のパーツ(...)はPerlがマッチした文字列をキャプチャーするようにさせます。

source: Switch statements
ja: Switch文

source: Symbol
ja: シンボル

source: Table: Pair forms and their meanings
ja: 表：Pairの形式とそれらの意味

source: Table: Backslash sequences and their meaning
ja: 表：バックスラッシュシーケンスとそれらの意味

source: Table: Binary numeric operators
ja: 表：2項数値演算子

source: Table: Binary string operators
ja: 表：2項文字列演算子

source: Table: C forms and their meanings
ja: 表：Pairの形式とその意味

source: Table: Contents of Variables
ja: 表：変数の内容

source: Table: Emulation of anchors with look-around assertions
ja: 表：周りを見るアサーションによるアンカーのエミュレーション

source: Table: Mathematical functions and methods
ja: 表：数学関数とメソッド

source: Table: Methods in the Parameter class
ja: 表：パラメータクラスのメソッド

source: Table: Operators and Comparisons
ja: 表：演算子と比較

source: Table: Precedence table
ja: 表：優先順位表

source: Table: Regex anchors
ja: 表：正規表現アンカー

source: Table: String methods/functions
ja: 表：文字列のメソッド、関数

source: Table: Unary numeric operators
ja: 表：単項数値演算子

source: Table: Unary string operators
ja: 表：単項文字列演算子

source: That has its flaws too, but it's more concrete.
ja: それは欠陥も持っています。しかしそれはより具体的です。

source: That is,
ja: すなわち、

source: That is, if you follow dependencies, you can eventually return to the original Task.
ja: つまり、従属物に続くならば、結局、あなたは最初のTaskに戻ることができます。

source: That is, precedence decisions do not cross a do boundary, and the missing "right paren" is assumed at the next statement terminator or unmatched bracket.
ja: すなわち、優先順位の決定はdoの境界を横切らず、欠けた「右括弧」は次の文の終止符か対応のとれていないブラケットと仮定される。

source: That is, the construct:
ja: すなわち、構成物：

source: That is, the stack is not unwound until some exception handler chooses to unwind it by "handling" the exception in question.
ja: すなわち、そのスタックはいくつかの例外ハンドラが問題の例外を「ハンドリング」することによってそれを巻き戻すために選ばれるまで巻き戻されない。

source: That is, these two statements are equivalent:
ja: つまり、これら二つの文は同等だ：

source: That should now be written:
ja: それは今は書き直されるべきだ：

source: That simple sort doesn't account for the number of sets won, which is the secondary criterion to decide who has won the tournament.
ja: その単純なソートは勝ったセット数を考えません。そしてそれは誰がトーナメントに勝ったかについて決める第2の基準です。

source: That way it is easy to add separate code for each action that the script can perform.
ja: スクリプトが実行することができるアクションごとに別々のコードを加えることは簡単です。

source: That's an abstract definition best explained by an example.
ja: それは例によって説明される抽象定義です。

source: That's okay too: declaring that a class performs a role does not require you to compose in any behavior from the role.
ja: それも大丈夫です：ロールを実行するそのクラスを宣言することは、ロールからのどんな振る舞いも合成を要求しません。

source: That's okay.)
ja: それはオーケーだ。）

source: That's why it's so happy!
ja: そういうわけで、それはとても幸せです！

source: The "first-class roles" mention needs to move out of a parenthetical note.
ja: “ファーストクラスロール”は、挿入句的なノートから動く必要に言及します。

source: The "point of declaration" is the moment the compiler sees "my $foo", not the end of the statement as in Perl 5, so
ja: 「宣言のポイント」はコンパイラが「my $foo」を見る時点であり、Perl 5における文の終わりではない。つまり

source: The "subclass" language is slightly wrong, but I don't know if we want to get into allomorphism here.
ja: “サブクラス”言語はわずかに間違っています。しかし、私は我々がここで同質異形を欲しいかどうか、わかりません。

source: The $ sigil indicates a scalar variable, which indicates that the variable stores a single value.
ja: $シギルはスカラー変数を表し、それは変数が一つの値を保存していることを示します。

source: The $Package'var syntax is gone.
ja: $Package'var構文はなくなりました。

source: The % sigil marks each variable as a Hash.
ja: %シギルはそれぞれの変数がHashであることを表します。

source: The %pluggables hash maps names of plug-ins to Role objects.
ja: ハッシュ%pluggablesはロールオブジェクトにプラグインの名前をマップします。

source: The & sigil followed by a subroutine name gets the object representing that subroutine.
ja: サブルーチン名の前の&シギルはサブルーチンのオブジェクトを表しています。

source: The & sigil indicates that this attribute represents something invocable.
ja: &シギルは属性が何かを起動可能であることを示します。

source: The - operator can also mean subtraction, so say 5 - 4 will print a 1.
ja: -演算子は減算も意味します。なのでsay 5 - 4は1を出力します。

source: The .* method calling syntax changes the semantics of the dispatch.
ja: .*メソッド呼び出し構文は、ディスパッチの意味を変えます。
